// Напишите функцию, которая принимает два числовых аргумента и возвращает наименьшее из них.

// Напишите функцию, которая принимает два числовых аргумента и выводит в консоль все четныечисла от большего к меньшему.

// Напишите функцию power, которая принимает два числовых аргумента (основание степени и саму степень) и возвращает число в указанной степени. Значение степени должно быть указано по умолчанию 2.

// Напишите функцию, которая принимает числовой аргумент n и считает сумму чисел от 1 до n.

// Напишите функцию, которая принимает два числовых аргумента n и m и считает сумму четных чисел и нечетных чисел от n до m. Суммы выведите в консоль (в начале сумму четных чисел, а затем сумму нечетных).


// Напишите функцию, которая принимает в качестве аргументов массив строк, а возвращает первый самый длинный элемент массива. Если входной массив пуст, функция возвращает null. Если есть несколько одинаковых по длине элементов - функция возвращает первый из этих элементов. 
// Пример: [ 'one', 'two', 'three' ] => 'three'



// ============= Задание N1 ==============
// function twoNumbers () {
//     const num1 = prompt("Введите первое число")
//     const num2 = prompt("Введите второе число")
//     if (num1 < num2) {
//         console.log(num1);
//     } else if (num2 < num1) {
//         console.log(num2);
//     } 
// }
// twoNumbers()

// ============= Задание N2 ==============
// function twoNumbers () {
//      const num1 = prompt("Введите первое число")
//      const num2 = prompt("Введите второе число")
//      if (num1, num2 % 2 === 0 && num1 > num2) {
//         console.log(num1, num2);
//      }
//      else if (num1, num2 % 2 === 0 ) {
//         console.log(num2, num1);
//     }   
// }
// twoNumbers()


// ============= Задание N3 ==============
// function power (a, b = 2) {
//     console.log(a**b);
// }
// power (4)


// ============= Задание N4 ==============

// Напишите функцию, которая принимает числовой аргумент n и считает сумму чисел от 1 до n.

// function number (n) {
//     let n1 = 0
//     for (let index = 1; index <= n; index++) {
//      n1 += index
//     }
//     console.log(n1);  
// }
// number(10)


// ============= Задание N5 ==============

// Напишите функцию, которая принимает два числовых аргумента n и m и считает сумму четных чисел и нечетных чисел от n до m. Суммы выведите в консоль (в начале сумму четных чисел, а затем сумму нечетных).

// function number (n, m) {
//     let n1 = 0
//     let m1 = 0
//     for (let index = n; index <= m; index++) {
//     if (index % 2 === 0) {
//         n1 += index
//     } else if (index % 2 !== 0) {
//         m1 += index
//     }
// }
// console.log(n1);
// console.log(m1);
// }
// number(8, 17)



// ============= Задание N6 ===============
// Напишите функцию, которая принимает в качестве аргументов массив строк, а возвращает первый самый длинный элемент массива. Если входной массив пуст, функция возвращает null. Если есть несколько одинаковых по длине элементов - функция возвращает первый из этих элементов. 
// Пример: [ 'one', 'two', 'three' ] => 'three'

// const arr = ['tree', 'grass', 'forest', 'earth', 'sun']
// function arrayString (array) {
//     for (let index = 0; index < array.length; index++) {
        
        
//     }
// }
























